noccy80/mspdev/reference/MSP430ware/deprecated/IAR/msp430f47126.h
#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  DEFXC                               MPY_B;
  DEFXW                               MPY;
} @ 0x0130;
#endif
#define MPYS_               (0x0132)  /* Multiply Signed/Operand 1 */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   MPYS              , MPYS_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  DEFXC                               MPYS_B;
  DEFXW                               MPYS;
} @ 0x0132;
#endif
#define MAC_                (0x0134)  /* Multiply Unsigned and Accumulate/Operand 1 */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   MAC               , MAC_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  DEFXC                               MAC_B;
  DEFXW                               MAC;
} @ 0x0134;
#endif
#define MACS_               (0x0136)  /* Multiply Signed and Accumulate/Operand 1 */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   MACS              , MACS_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  DEFXC                               MACS_B;
  DEFXW                               MACS;
} @ 0x0136;
#endif
#define OP2_                (0x0138)  /* Operand 2 */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   OP2               , OP2_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  DEFXC                               OP2_B;
  DEFXW                               OP2;
} @ 0x0138;
#endif
#define RESLO_              (0x013Au)  /* Result Low Word */
DEFW(   RESLO             , RESLO_)
#define RESHI_              (0x013Cu)  /* Result High Word */
DEFW(   RESHI             , RESHI_)
#define SUMEXT_             (0x013Eu)  /* Sum Extend */
READ_ONLY DEFW( SUMEXT         , SUMEXT_)

#define MPY32L_B_           (0x0140)  /* 32-bit operand 1 - multiply - low word (Byte Access) */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   MPY32L_B          , MPY32L_B_)
#endif
#define MPY32H_B_           (0x0142)  /* 32-bit operand 1 - multiply - high word (Byte Access) */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   MPY32H_B          , MPY32H_B_)
#endif
#define MPYS32L_B_          (0x0144)  /* 32-bit operand 1 - signed multiply - low word (Byte Access) */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   MPYS32L_B         , MPYS32L_B_)
#endif
#define MPYS32H_B_          (0x0146)  /* 32-bit operand 1 - signed multiply - high word (Byte Access) */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   MPYS32H_B         , MPYS32H_B_)
#endif
#define MAC32L_B_           (0x0148)  /* 32-bit operand 1 - multiply accumulate - low word (Byte Access) */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   MAC32L_B          , MAC32L_B_)
#endif
#define MAC32H_B_           (0x014A)  /* 32-bit operand 1 - multiply accumulate - high word (Byte Access) */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   MAC32H_B          , MAC32H_B_)
#endif
#define MACS32L_B_          (0x014C)  /* 32-bit operand 1 - signed multiply accumulate - low word (Byte Access) */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   MACS32L_B         , MACS32L_B_)
#endif
#define MACS32H_B_          (0x014E)  /* 32-bit operand 1 - signed multiply accumulate - high word (Byte Access) */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   MACS32H_B         , MACS32H_B_)
#endif
#define OP2L_B_             (0x0150)  /* 32-bit operand 2 - low word (Byte Access) */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   OP2L_B            , OP2L_B_)
#endif
#define OP2H_B_             (0x0152)  /* 32-bit operand 2 - high word (Byte Access) */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   OP2H_B            , OP2H_B_)
#endif
#define MPY32L_             (0x0140)  /* 32-bit operand 1 - multiply - low word */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   MPY32L            , MPY32L_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  DEFXC                               MPY32L_B;
  DEFXW                               MPY32L;
} @ 0x0140;
#endif
#define MPY32H_             (0x0142)  /* 32-bit operand 1 - multiply - high word */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   MPY32H            , MPY32H_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  DEFXC                               MPY32H_B;
  DEFXW                               MPY32H;
} @ 0x0142;
#endif
#define MPYS32L_            (0x0144)  /* 32-bit operand 1 - signed multiply - low word */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   MPYS32L           , MPYS32L_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  DEFXC                               MPYS32L_B;
  DEFXW                               MPYS32L;
} @ 0x0144;
#endif
#define MPYS32H_            (0x0146)  /* 32-bit operand 1 - signed multiply - high word */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   MPYS32H           , MPYS32H_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  DEFXC                               MPYS32H_B;
  DEFXW                               MPYS32H;
} @ 0x0146;
#endif
#define MAC32L_             (0x0148)  /* 32-bit operand 1 - multiply accumulate - low word */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   MAC32L            , MAC32L_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  DEFXC                               MAC32L_B;
  DEFXW                               MAC32L;
} @ 0x0148;
#endif
#define MAC32H_             (0x014A)  /* 32-bit operand 1 - multiply accumulate - high word */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   MAC32H            , MAC32H_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  DEFXC                               MAC32H_B;
  DEFXW                               MAC32H;
} @ 0x014A;
#endif
#define MACS32L_            (0x014C)  /* 32-bit operand 1 - signed multiply accumulate - low word */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   MACS32L           , MACS32L_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  DEFXC                               MACS32L_B;
  DEFXW                               MACS32L;
} @ 0x014C;
#endif
#define MACS32H_            (0x014E)  /* 32-bit operand 1 - signed multiply accumulate - high word */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   MACS32H           , MACS32H_)
#endif

