noccy80/mspdev/reference/MSP430ware/deprecated/IAR/msp430f47126.h
#define P7IN_               (0x0038)  /* Port 7 Input */
#ifndef __IAR_SYSTEMS_ICC__
READ_ONLY DEFC( P7IN           , P7IN_)
#endif
#define P7OUT_              (0x003A)  /* Port 7 Output */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   P7OUT             , P7OUT_)
#endif
#define P7DIR_              (0x003C)  /* Port 7 Direction */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   P7DIR             , P7DIR_)
#endif
#define P7SEL_              (0x003E)  /* Port 7 Selection */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   P7SEL             , P7SEL_)
#endif
#define P7REN_              (0x0014)  /* Port 7 Resistor Enable */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   P7REN             , P7REN_)
#endif

#define P8IN_               (0x0039)  /* Port 8 Input */
#ifndef __IAR_SYSTEMS_ICC__
READ_ONLY DEFC( P8IN           , P8IN_)
#endif
#define P8OUT_              (0x003B)  /* Port 8 Output */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   P8OUT             , P8OUT_)
#endif
#define P8DIR_              (0x003D)  /* Port 8 Direction */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   P8DIR             , P8DIR_)
#endif
#define P8SEL_              (0x003F)  /* Port 8 Selection */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   P8SEL             , P8SEL_)
#endif
#define P8REN_              (0x0015)  /* Port 8 Resistor Enable */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   P8REN             , P8REN_)
#endif

#define PAIN_               (0x0038)  /* Port A Input */
#ifndef __IAR_SYSTEMS_ICC__
READ_ONLY DEFW( PAIN           , PAIN_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  struct
  {
    READ_ONLY DEFXC                   P7IN;
    READ_ONLY DEFXC                   P8IN;
  };
  READ_ONLY DEFXW                     PAIN;
} @ 0x0038;
#endif
#define PAOUT_              (0x003A)  /* Port A Output */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   PAOUT             , PAOUT_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  struct
  {
    DEFXC                             P7OUT;
    DEFXC                             P8OUT;
  };
  DEFXW                               PAOUT;
} @ 0x003A;
#endif
#define PADIR_              (0x003C)  /* Port A Direction */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   PADIR             , PADIR_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  struct
  {
    DEFXC                             P7DIR;
    DEFXC                             P8DIR;
  };
  DEFXW                               PADIR;
} @ 0x003C;
#endif
#define PASEL_              (0x003E)  /* Port A Selection */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   PASEL             , PASEL_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  struct
  {
    DEFXC                             P7SEL;
    DEFXC                             P8SEL;
  };
  DEFXW                               PASEL;
} @ 0x003E;
#endif
#define PAREN_              (0x0014)  /* Port A Resistor Enable */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   PAREN             , PAREN_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  struct
  {
    DEFXC                             P7REN;
    DEFXC                             P8REN;
  };
  DEFXW                               PAREN;
} @ 0x0014;
#endif

/************************************************************
* DIGITAL I/O Port9/10 Pull up / Pull down Resistors
************************************************************/
#define __MSP430_HAS_PORT9_R__        /* Definition to show that Module is available */
#define __MSP430_HAS_PORT10_R__       /* Definition to show that Module is available */
#define __MSP430_HAS_PORTB_R__        /* Definition to show that Module is available */

#define P9IN_               (0x0008)  /* Port 9 Input */
#ifndef __IAR_SYSTEMS_ICC__
READ_ONLY DEFC( P9IN           , P9IN_)
#endif
#define P9OUT_              (0x000A)  /* Port 9 Output */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   P9OUT             , P9OUT_)
#endif
#define P9DIR_              (0x000C)  /* Port 9 Direction */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   P9DIR             , P9DIR_)
#endif
#define P9SEL_              (0x000E)  /* Port 9 Selection */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   P9SEL             , P9SEL_)
#endif
#define P9REN_              (0x0016)  /* Port 9 Resistor Enable */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   P9REN             , P9REN_)
#endif

#define P10IN_              (0x0009)  /* Port 10 Input */
#ifndef __IAR_SYSTEMS_ICC__
READ_ONLY DEFC( P10IN          , P10IN_)
#endif
#define P10OUT_             (0x000B)  /* Port 10 Output */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   P10OUT            , P10OUT_)
#endif
#define P10DIR_             (0x000D)  /* Port 10 Direction */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   P10DIR            , P10DIR_)
#endif
#define P10SEL_             (0x000F)  /* Port 10 Selection */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   P10SEL            , P10SEL_)
#endif
#define P10REN_             (0x0017)  /* Port 10 Resistor Enable */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   P10REN            , P10REN_)
#endif

#define PBIN_               (0x0008)  /* Port B Input */
#ifndef __IAR_SYSTEMS_ICC__
READ_ONLY DEFW( PBIN           , PBIN_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  struct
  {
    READ_ONLY DEFXC                   P9IN;
    READ_ONLY DEFXC                   P10IN;
  };
  READ_ONLY DEFXW                     PBIN;
} @ 0x0008;
#endif
#define PBOUT_              (0x000A)  /* Port B Output */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   PBOUT             , PBOUT_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  struct
  {
    DEFXC                             P9OUT;
    DEFXC                             P10OUT;
  };
  DEFXW                               PBOUT;
} @ 0x000A;
#endif
#define PBDIR_              (0x000C)  /* Port B Direction */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   PBDIR             , PBDIR_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  struct
  {
    DEFXC                             P9DIR;
    DEFXC                             P10DIR;
  };
  DEFXW                               PBDIR;
} @ 0x000C;
#endif
#define PBSEL_              (0x000E)  /* Port B Selection */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   PBSEL             , PBSEL_)
#endif

