noccy80/mspdev/reference/MSP430ware/deprecated/IAR/msp430f47126.h
#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  struct
  {
    DEFXC                             P9SEL;
    DEFXC                             P10SEL;
  };
  DEFXW                               PBSEL;
} @ 0x000E;
#endif
#define PBREN_              (0x0016)  /* Port B Resistor Enable */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   PBREN             , PBREN_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  struct
  {
    DEFXC                             P9REN;
    DEFXC                             P10REN;
  };
  DEFXW                               PBREN;
} @ 0x0016;
#endif

/************************************************************
* Brown-Out, Supply Voltage Supervision (SVS)
************************************************************/
#define __MSP430_HAS_SVS__            /* Definition to show that Module is available */

#define SVSCTL_             (0x0056u)  /* SVS Control */
DEFC(   SVSCTL            , SVSCTL_)
#define SVSFG               (0x01)    /* SVS Flag */
#define SVSOP               (0x02)    /* SVS output (read only) */
#define SVSON               (0x04)    /* Switches the SVS on/off */
#define PORON               (0x08)    /* Enable POR Generation if Low Voltage */
#define VLD0                (0x10)
#define VLD1                (0x20)
#define VLD2                (0x40)
#define VLD3                (0x80)

#define VLDON               (0x10)
#define VLDOFF              (0x00)
#define VLD_1_8V            (0x10)

/************************************************************
* SD16_A6 - Sigma Delta 16 Bit
************************************************************/
#define __MSP430_HAS_SD16_A6__        /* Definition to show that Module is available */

#define SD16INCTL0_         (0x00B0u)  /* SD16 Input Control Register Channel 0 */
DEFC(   SD16INCTL0        , SD16INCTL0_)
#define SD16INCTL1_         (0x00B1u)  /* SD16 Input Control Register Channel 1 */
DEFC(   SD16INCTL1        , SD16INCTL1_)
#define SD16INCTL2_         (0x00B2u)  /* SD16 Input Control Register Channel 2 */
DEFC(   SD16INCTL2        , SD16INCTL2_)
#define SD16INCTL3_         (0x00B3u)  /* SD16 Input Control Register Channel 3 */
DEFC(   SD16INCTL3        , SD16INCTL3_)
#define SD16INCTL4_         (0x00B4u)  /* SD16 Input Control Register Channel 4 */
DEFC(   SD16INCTL4        , SD16INCTL4_)
#define SD16INCTL5_         (0x00B5u)  /* SD16 Input Control Register Channel 5 */
DEFC(   SD16INCTL5        , SD16INCTL5_)
#define SD16PRE0_           (0x00B8u)  /* SD16 Preload Register Channel 0 */
DEFC(   SD16PRE0          , SD16PRE0_)
#define SD16PRE1_           (0x00B9u)  /* SD16 Preload Register Channel 1 */
DEFC(   SD16PRE1          , SD16PRE1_)
#define SD16PRE2_           (0x00BAu)  /* SD16 Preload Register Channel 2 */
DEFC(   SD16PRE2          , SD16PRE2_)
#define SD16PRE3_           (0x00BBu)  /* SD16 Preload Register Channel 3 */
DEFC(   SD16PRE3          , SD16PRE3_)
#define SD16PRE4_           (0x00BCu)  /* SD16 Preload Register Channel 4 */
DEFC(   SD16PRE4          , SD16PRE4_)
#define SD16PRE5_           (0x00BDu)  /* SD16 Preload Register Channel 5 */
DEFC(   SD16PRE5          , SD16PRE5_)
#define SD16CONF0_          (0x00B7u)  /* SD16 Internal Configuration Register 0 */
DEFC(   SD16CONF0         , SD16CONF0_)
#define SD16CONF1_          (0x00BFu)  /* SD16 Internal Configuration Register 1 */
DEFC(   SD16CONF1         , SD16CONF1_)
                                      /* Please use only the recommended settings */

#define SD16CTL_            (0x0100u)  /* Sigma Delta ADC 16 Control Register */
DEFW(   SD16CTL           , SD16CTL_)
#define SD16CCTL0_          (0x0102u)  /* SD16 Channel 0 Control Register */
DEFW(   SD16CCTL0         , SD16CCTL0_)
#define SD16CCTL1_          (0x0104u)  /* SD16 Channel 1 Control Register */
DEFW(   SD16CCTL1         , SD16CCTL1_)
#define SD16CCTL2_          (0x0106u)  /* SD16 Channel 2 Control Register */
DEFW(   SD16CCTL2         , SD16CCTL2_)
#define SD16CCTL3_          (0x0108u)  /* SD16 Channel 3 Control Register */
DEFW(   SD16CCTL3         , SD16CCTL3_)
#define SD16CCTL4_          (0x010Au)  /* SD16 Channel 4 Control Register */
DEFW(   SD16CCTL4         , SD16CCTL4_)
#define SD16CCTL5_          (0x010Cu)  /* SD16 Channel 5 Control Register */
DEFW(   SD16CCTL5         , SD16CCTL5_)
#define SD16MEM0_           (0x0110u)  /* SD16 Channel 0 Conversion Memory */
DEFW(   SD16MEM0          , SD16MEM0_)
#define SD16MEM1_           (0x0112u)  /* SD16 Channel 1 Conversion Memory */
DEFW(   SD16MEM1          , SD16MEM1_)
#define SD16MEM2_           (0x0114u)  /* SD16 Channel 2 Conversion Memory */
DEFW(   SD16MEM2          , SD16MEM2_)
#define SD16MEM3_           (0x0116u)  /* SD16 Channel 3 Conversion Memory */
DEFW(   SD16MEM3          , SD16MEM3_)
#define SD16MEM4_           (0x0118u)  /* SD16 Channel 4 Conversion Memory */
DEFW(   SD16MEM4          , SD16MEM4_)
#define SD16MEM5_           (0x011Au)  /* SD16 Channel 5 Conversion Memory */
DEFW(   SD16MEM5          , SD16MEM5_)
#define SD16IV_             (0x01AEu)  /* SD16 Interrupt Vector Register */
DEFW(   SD16IV            , SD16IV_)

/* SD16INCTLx */
#define SD16INCH0           (0x0001u)  /* SD16 Input Channel select 0 */
#define SD16INCH1           (0x0002u)  /* SD16 Input Channel select 1 */
#define SD16INCH2           (0x0004u)  /* SD16 Input Channel select 2 */
#define SD16GAIN0           (0x0008u)  /* SD16 Input Pre-Amplifier Gain Select 0 */
#define SD16GAIN1           (0x0010u)  /* SD16 Input Pre-Amplifier Gain Select 1 */
#define SD16GAIN2           (0x0020u)  /* SD16 Input Pre-Amplifier Gain Select 2 */
#define SD16INTDLY0         (0x0040u)  /* SD16 Interrupt Delay after 1.Conversion 0 */
#define SD16INTDLY1         (0x0080u)  /* SD16 Interrupt Delay after 1.Conversion 1 */

#define SD16GAIN_1          (0x0000u)  /* SD16 Input Pre-Amplifier Gain Select *1  */
#define SD16GAIN_2          (0x0008u)  /* SD16 Input Pre-Amplifier Gain Select *2  */
#define SD16GAIN_4          (0x0010u)  /* SD16 Input Pre-Amplifier Gain Select *4  */
#define SD16GAIN_8          (0x0018u)  /* SD16 Input Pre-Amplifier Gain Select *8  */
#define SD16GAIN_16         (0x0020u)  /* SD16 Input Pre-Amplifier Gain Select *16 */
#define SD16GAIN_32         (0x0028u)  /* SD16 Input Pre-Amplifier Gain Select *32 */

#define SD16INCH_0          (0x0000u)  /* SD16 Input Channel select input */
#define SD16INCH_1          (0x0001u)  /* SD16 Input Channel select input */
#define SD16INCH_2          (0x0002u)  /* SD16 Input Channel select input */
#define SD16INCH_3          (0x0003u)  /* SD16 Input Channel select input */
#define SD16INCH_4          (0x0004u)  /* SD16 Input Channel select input */
#define SD16INCH_5          (0x0005u)  /* SD16 Input Channel select Vcc divider */
#define SD16INCH_6          (0x0006u)  /* SD16 Input Channel select Temp */
#define SD16INCH_7          (0x0007u)  /* SD16 Input Channel select Offset */

#define SD16INTDLY_0        (0x0000u)  /* SD16 Interrupt Delay: Int. after 4.Conversion  */
#define SD16INTDLY_1        (0x0040u)  /* SD16 Interrupt Delay: Int. after 3.Conversion  */
#define SD16INTDLY_2        (0x0080u)  /* SD16 Interrupt Delay: Int. after 2.Conversion  */
#define SD16INTDLY_3        (0x00C0u)  /* SD16 Interrupt Delay: Int. after 1.Conversion  */

/* SD16CTL */
#define SD16OVIE            (0x0002u)  /* SD16 Overflow Interupt Enable */
#define SD16REFON           (0x0004u)  /* SD16 Switch internal Reference on */
#define SD16VMIDON          (0x0008u)  /* SD16 Switch Vmid Buffer on */
#define SD16SSEL0           (0x0010u)  /* SD16 Clock Source Select 0 */
#define SD16SSEL1           (0x0020u)  /* SD16 Clock Source Select 1 */
#define SD16DIV0            (0x0040u)  /* SD16 Clock Divider Select 0 */
#define SD16DIV1            (0x0080u)  /* SD16 Clock Divider Select 1 */
#define SD16LP              (0x0100u)  /* SD16 Low Power Mode Enable */
#define SD16XDIV0           (0x0200u)  /* SD16 2.Clock Divider Select 0 */
#define SD16XDIV1           (0x0400u)  /* SD16 2.Clock Divider Select 1 */
//#define SD16XDIV2           (0x0800u)  /* SD16 2.Clock Divider Select 2 */

#define SD16DIV_0            (0x0000u)               /* SD16 Clock Divider Select /1 */
#define SD16DIV_1            (SD16DIV0)             /* SD16 Clock Divider Select /2 */
#define SD16DIV_2            (SD16DIV1)             /* SD16 Clock Divider Select /4 */
#define SD16DIV_3            (SD16DIV0+SD16DIV1)    /* SD16 Clock Divider Select /8 */

#define SD16XDIV_0          (0x0000u)               /* SD16 2.Clock Divider Select /1 */
#define SD16XDIV_1          (SD16XDIV0)            /* SD16 2.Clock Divider Select /3 */
#define SD16XDIV_2          (SD16XDIV1)            /* SD16 2.Clock Divider Select /16 */
#define SD16XDIV_3          (SD16XDIV0+SD16XDIV1)  /* SD16 2.Clock Divider Select /48 */

#define SD16SSEL_0           (0x0000u)               /* SD16 Clock Source Select MCLK  */
#define SD16SSEL_1           (SD16SSEL0)            /* SD16 Clock Source Select SMCLK */
#define SD16SSEL_2           (SD16SSEL1)            /* SD16 Clock Source Select ACLK  */
#define SD16SSEL_3           (SD16SSEL0+SD16SSEL1)  /* SD16 Clock Source Select TACLK */

